//Создать свою иерархию классов отражающую иерархию некоторой организации,
//        Например: менеджер - начальник отдела - директор. Описать характеристики (состояние и поведение) для каждого из участников
//        Далее сценарий
//        В некоторой организации необходимо разработать программу взаимодействия с клиентами в которой можно просмотреть данные клиента.
//        У менеджера нет прав для изменения или просмотра некоторых данных. Создайте класс, в котором будут содержаться следующие поля:
//
//        - ФИО
//        - Дата рождения
//        - Номер паспорта
//
//        Менеджер не имеет доступа к просмотру информации. Вместо данных паспорта он видит символы: «...», — если поле не пустое.
//        Менеджер не может изменять поля «Фамилия», «Имя», «Отчество», но может их просматривать.
//        Консультант может изменить «Номер телефона», но при этом поле должно быть всегда заполнено.
//
//        Продумать возможность изменения данных при повышении уровня доступа

public class myHierarchy {
}
